# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.
# *Пример:*
# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8 

def power_num(x, y):
    if y == 1:
        return x
    return x * power_num(x, y-1)

a = int(input('Введите число: '))
b = int(input('Введите степень числа: '))

print("A =", a, "; B =", b, "->", power_num(a, b))