# Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

inNumber = int(input('Введите количество журавликов: '))
if bool(inNumber%6):
    print('Не получается целое количество журавликов!')
else:
    print(inNumber, '->', inNumber//6, inNumber//6*4, inNumber//6)